module_2/mes_petits_tests/mini-carousel-rails/app/views/coachings/carousel/_coach_card.html.erb

    <div class="coach-card__button"></div>
    <div class="coach-card__img"><%= coach.name.split.map(&:first).join %></div>
---
SELECT "coaches".* FROM "coaches" ORDER BY "coaches"."id" DESC LIMIT 1