module_2/mes_petits_tests/mini-carousel-rails/app/views/coachings/show.html.erb

SELECT "coaches".* FROM "coaches"
SELECT "coaches".* FROM "coaches" ORDER BY "coaches"."id" DESC LIMIT 1
---
  Essaie avec different coaches actuels :
  <% Coach.all.each do |coach| %>
    <a href="/?current_coach_id=<%= coach.id %>"><%= coach.name %></a><%= " | " unless coach == Coach.last %>