module_2/mes_petits_tests/mini-carousel-rails/app/controllers/coachings_controller.rb

  def show
    # Simule le coach actuel (comme @relationship.expert dans Simundia)
    @current_coach = Coach.find_by(id: params[:current_coach_id]) || Coach.first

    # Charge les coaches disponibles (comme load_change_coach_experts dans Simundia)
    @coaches = Coach.all
---
SELECT "coaches".* FROM "coaches" WHERE "coaches"."id" IS NULL LIMIT 1
SELECT "coaches".* FROM "coaches" ORDER BY "coaches"."id" ASC LIMIT 1

  def change_coach
    # Exactement comme RelationshipsController#change_coach dans Simundia :
    # on recoit UNIQUEMENT coach_email (que ce soit via carousel ou recherche)
    new_coach_email = params[:coach_email]
    new_coach = Coach.find_by(email: new_coach_email)
---
SELECT "coaches".* FROM "coaches" WHERE "coaches"."email" = 'pierre.martin@coaching.fr' LIMIT 1